# GetFPathName

## Description
Returns the fully-qualified file path of the active document.

```pascal
FUNCTION GetFPathName : DYNARRAY[] of CHAR;
```

```python

def vs.GetFPathName():
    return DYNARRAY[] of CHAR
```

## Version
Availability: from Vectorworks 2014
## Category
* File I/O